InformationRegisters/ГАЗЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ГАЗЗаявки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Comment>Дата регистрации заявки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Comment>Регион клиента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Comment>Электронная почта контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ид</Name>
					<Comment>Внешний ID из системы ГАЗ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиРазмещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗадачиГАЗЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиГАЗЗаявки</Name>
			<Comment>Задачи по заявкам ГАЗ: Реестр</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресацияРоль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Роли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Имя интернет-ресурса нашей компании, с которого было получено обращение на автозвонок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Comment>Дата постановки задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура заявки ГАЗ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоПерезвона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеПерезвонить</Name>
					<Comment>Напоминание в часах о необходимости перезвона</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокЗакрытия</Name>
					<Comment>Сигнатура звонка закрывшего задачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уточнение</Name>
					<Comment>Причина возврата задачи на повторое исполнение (задача не принята клиентской службой)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГАЗЗаявки/Ext/RecordSetModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)	
	ЭтотОбъект[0].Сигнатура 		= "gz_"+Строка(Новый УникальныйИдентификатор());		
	ЭтотОбъект[0].Начало	    	= ТекущаяДата();
	ЭтотОбъект[0].ТочкаРазмещения	= ПараметрыСеанса.ТекущийПользователь.ТочкаРазмещения.Родитель;	
	ЭтотОбъект[0].Автор				= ПараметрыСеанса.ТекущийПользователь;	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Доступно = Истина;
	Доступно = Доступно И ЭтотОбъект.Количество()>0;
	Если Доступно = Ложь Тогда
		Возврат;
	КонецЕсли;
		
	Доступно = Истина;
	Доступно = Доступно И (ЗначениеЗаполнено(ЭтотОбъект[0].АбонентВнешний) Или ЗначениеЗаполнено(ЭтотОбъект[0].Почта));	
	Если Доступно = Ложь Тогда
		Сообщить("Почта или телефон должны быть обязательно заполнены");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//Задана почта, но адрес не верен
	//--------------------------------
	Доступно = Истина;
	Доступно = Доступно И Не ЗначениеЗаполнено(ЭтотОбъект[0].АбонентВнешний);
	Доступно = Доступно И ЗначениеЗаполнено(ЭтотОбъект[0].Почта);
	Если Доступно = Истина Тогда
		Доступно = Истина;
		Доступно = Доступно И СтрНайти(ЭтотОбъект[0].Почта, "@")>0;
		Доступно = Доступно И СтрДлина(ЭтотОбъект[0].Почта)>6;
		Если Доступно = Ложь Тогда
			Сообщить("Ошибка в адресе почты");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	ЭтотОбъект.ПроверитьЗаполнение();
	
	Если ЭтотОбъект.Количество()>0 Тогда
		ЭтоНовый = Не ЗначениеЗаполнено(ЭтотОбъект[0].Окончание);
		
		Если ЭтоНовый = Истина Тогда
			Если Не ЗначениеЗаполнено(ЭтотОбъект[0].Начало) Тогда
				ЭтотОбъект[0].Начало 		 	= ТекущаяДата();
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ЭтотОбъект[0].АбонентВнешний) Тогда 
				ЭтотОбъект[0].АбонентВнешний 	= Конвертация.ТелефонВнешнийНормализовать(ЭтотОбъект[0].АбонентВнешний); 
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ЭтотОбъект[0].ТочкаРазмещения) Тогда
				ЭтотОбъект[0].ТочкаРазмещения 	= ПараметрыСеанса.ТекущийПользователь.ТочкаРазмещения.Родитель; 
			КонецЕсли;
						
			Рез = СоздатьЗадачуЗвонить(ЭтотОбъект[0].АбонентВнешний, ЭтотОбъект[0].Сигнатура, Справочники.Роли.ОператорКонтактЦентра, ЭтотОбъект[0].Начало, ЭтотОбъект[0].Почта); 
			Если Рез <> "ок" Тогда
				Сообщить("Рез");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьЗадачуЗвонить(Телефон, Сигнатура, Роль, Начало, Почта)
	Данные = "Телефон = "+Телефон+"; Сигнатура = "+Сигнатура+"; Роль = "+Роль+"; Начало = "+Начало+"; Почта = "+Почта;
	Результат = "Ошибка";

	//Если в поле телефон записаны не цифры (например слово "НЕТ") и указана почта, тогда используй почту как ключ
	//-------------------------------------------------------------------------------------------------------------
	Доступно = 	  ЗначениеЗаполнено(Телефон)
				И КонвертацияСервер.ЭтоТолькоЦифры(Телефон) = Ложь
				И ЗначениеЗаполнено(Почта);                     	
	Если Доступно Тогда
		Телефон = Почта;		
	КонецЕсли;

	//Если телефон не заполнен Заполнен входящий параметр "Почта" фиксируем его в реквизите Телефон задачи
	//-----------------------------------------------------------------------------------------------------
	Доступно = 		Не ЗначениеЗаполнено(Телефон)
				И 	ЗначениеЗаполнено(Почта);
	Если Доступно Тогда
		Телефон = Почта;
	КонецЕсли;
		
	Зап = РегистрыСведений.ЗадачиГАЗЗаявки.СоздатьМенеджерЗаписи();
	Зап.Телефон 		= Телефон;
	Зап.АдресацияРоль 	= Справочники.Роли.ОператорКонтактЦентра;
	Зап.ДатаПостановки 	= Начало;
	Зап.Сигнатура		= Сигнатура;
	Попытка 
		Зап.Записать();
		Результат = "ок";
	Исключение
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Ошибка записи задачи", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗадачиГАЗЗаявки, Данные, Комментарий);
		Возврат "Ошибка: задача не создана";
	КонецПопытки;
	Возврат "ок";
КонецФункции
